silabs-bozont/ArduinoCore-zephyr/boards.txt
menu.debug=Debug
menu.mode=Mode

giga.name=Arduino Giga R1
giga.build.core=arduino
giga.build.crossprefix=arm-zephyr-eabi-
giga.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

giga.menu.debug.false=Standard
giga.menu.debug.true=Debug

giga.menu.debug.false.postbuild_debug=
giga.menu.debug.true.postbuild_debug=-debug

giga.build.variant=arduino_giga_r1_m7
giga.build.mcu=cortex-m7
giga.build.fpu=-mfpu=fpv5-d16
giga.build.architecture=cortex-m7
giga.compiler.zephyr.arch.define=-DCORE_CM7

giga.build.board={build.variant}

giga.build.float-abi=-mfloat-abi=softfp
giga.build.extra_flags=
giga.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
giga.build.architecture=cortex-m7
giga.build.board=GIGA
giga.compiler.zephyr=
giga.vid.0=0x2341
giga.pid.0=0x0066
giga.upload_port.0.vid=0x2341
giga.upload_port.0.pid=0x0066

giga.upload.tool=dfu-util
giga.upload.tool.default=dfu-util
giga.upload.protocol=
giga.upload.transport=
giga.upload.vid=0x2341
giga.upload.pid=0x0366
giga.upload.interface=0
giga.upload.use_1200bps_touch=true
giga.upload.wait_for_upload_port=true
giga.upload.native_usb=true
giga.upload.maximum_size=1966080
giga.upload.maximum_data_size=523624

giga.upload.address=0x080E0000

giga.upload.maximum_size=786432
giga.upload.maximum_data_size=523624

giga.bootloader.tool=dfu-util
giga.bootloader.tool.default=dfu-util
giga.bootloader.vid=0x2341
giga.bootloader.pid=0x0366
giga.bootloader.interface=0
giga.bootloader.file=zephyr-arduino_giga_r1_m7.bin
giga.bootloader.address=0x08040000

giga.debug.tool=gdb
giga.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
giga.debug.server.openocd.scripts.1={programmer.transport_script}
giga.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
giga.debug.cortex-debug.custom.request=attach
giga.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd

##########################################################################################

nano33ble.name=Arduino Nano 33 BLE
nano33ble.build.core=arduino
nano33ble.build.crossprefix=arm-zephyr-eabi-
nano33ble.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

nano33ble.menu.debug.false=Standard
nano33ble.menu.debug.true=Debug

nano33ble.menu.debug.false.postbuild_debug=
nano33ble.menu.debug.true.postbuild_debug=-debug

nano33ble.build.variant=arduino_nano_33_ble_sense
nano33ble.build.mcu=cortex-m4
nano33ble.build.fpu=-mfpu=fpv4-sp-d16
nano33ble.build.architecture=cortex-m4
nano33ble.compiler.zephyr.arch.define=

nano33ble.build.board={build.variant}

nano33ble.build.float-abi=-mfloat-abi=hard
nano33ble.build.extra_flags=
nano33ble.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
nano33ble.build.architecture=cortex-m4
nano33ble.build.board=ARDUINO_NANO33BLE
nano33ble.compiler.zephyr=
nano33ble.vid.0=0x2341
nano33ble.pid.0=0x035a
nano33ble.upload_port.0.vid=0x2341
nano33ble.upload_port.0.pid=0x005a

nano33ble.upload.tool=bossac
nano33ble.upload.tool.default=bossac
nano33ble.upload.protocol=
nano33ble.upload.transport=
nano33ble.upload.vid=0x2341
nano33ble.upload.pid=0x005a
nano33ble.upload.interface=0
nano33ble.upload.use_1200bps_touch=true
nano33ble.upload.wait_for_upload_port=true
nano33ble.upload.native_usb=true
nano33ble.upload.maximum_size=1966080
nano33ble.upload.maximum_data_size=523624
nano33ble.upload.address=0xD0000

nano33ble.upload.maximum_size=786432
nano33ble.upload.maximum_data_size=523624

nano33ble.bootloader.tool=bossac
nano33ble.bootloader.tool.default=bossac
nano33ble.bootloader.vid=0x2341
nano33ble.bootloader.pid=0x035b
nano33ble.bootloader.interface=0
nano33ble.bootloader.file=zephyr-arduino_nano_33_ble_sense.bin
nano33ble.bootloader.address=0x0000

nano33ble.debug.tool=gdb
nano33ble.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
nano33ble.debug.server.openocd.scripts.1={programmer.transport_script}
nano33ble.debug.server.openocd.scripts.2=target/nrf52.cfg
nano33ble.debug.cortex-debug.custom.request=attach

##############################################################################################################

ek_ra8d1.name=EK_RA8D1
ek_ra8d1.build.core=arduino
ek_ra8d1.build.crossprefix=arm-zephyr-eabi-
ek_ra8d1.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

ek_ra8d1.menu.debug.false=Standard
ek_ra8d1.menu.debug.true=Debug

ek_ra8d1.menu.debug.false.postbuild_debug=
ek_ra8d1.menu.debug.true.postbuild_debug=-debug

ek_ra8d1.build.variant=ek_ra8d1
ek_ra8d1.build.mcu=cortex-m85+nomve
ek_ra8d1.build.fpu=-mfpu=fpv5-d16
ek_ra8d1.build.architecture=cortex-m85+nomve
ek_ra8d1.compiler.zephyr.arch.define=

ek_ra8d1.build.board={build.variant}

ek_ra8d1.build.float-abi=-mfloat-abi=hard
ek_ra8d1.build.extra_flags=
ek_ra8d1.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
ek_ra8d1.build.architecture=cortex-m85+nomve
ek_ra8d1.build.board=ek_ra8d1
ek_ra8d1.compiler.zephyr.arch.define=

#ek_ra8d1.recipe.hooks.objcopy.postobjcopy.4.pattern=cp {build.variant.path}/flasher.jlink "{build.path}/flasher.jlink"
#ek_ra8d1.recipe.hooks.objcopy.postobjcopy.5.pattern=sed -i 's|SKETCH|"{build.path}/{build.project_name}.llext.dfu.bin"|g' "{build.path}/flasher.jlink"

ek_ra8d1.compiler.zephyr=
ek_ra8d1.vid.0=0x2341
ek_ra8d1.pid.0=0x0077
ek_ra8d1.upload_port.0.vid=0x2341
ek_ra8d1.upload_port.0.pid=0x0077

ek_ra8d1.upload.tool=pyocd
ek_ra8d1.upload.tool.default=pyocd
ek_ra8d1.upload.protocol=
ek_ra8d1.upload.transport=
ek_ra8d1.upload.vid=0x2341
ek_ra8d1.upload.pid=0x0366
ek_ra8d1.upload.interface=0
ek_ra8d1.upload.use_1200bps_touch=false
ek_ra8d1.upload.wait_for_upload_port=false
ek_ra8d1.upload.native_usb=true
ek_ra8d1.upload.maximum_size=1966080
ek_ra8d1.upload.maximum_data_size=523624
ek_ra8d1.upload.address=0x2032000
ek_ra8d1.upload.target=R7FA8D1AH

ek_ra8d1.bootloader.tool=pyocd
ek_ra8d1.bootloader.tool.default=pyocd
ek_ra8d1.bootloader.file=zephyr-ek_ra8d1.elf
ek_ra8d1.bootloader.target=R7FA8D1AH


##############################################################################################################

frdm_mcxn947.name=MCXN947
frdm_mcxn947.build.core=arduino
frdm_mcxn947.build.crossprefix=arm-zephyr-eabi-
frdm_mcxn947.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

frdm_mcxn947.menu.debug.false=Standard
frdm_mcxn947.menu.debug.true=Debug

frdm_mcxn947.menu.debug.false.postbuild_debug=
frdm_mcxn947.menu.debug.true.postbuild_debug=-debug

frdm_mcxn947.build.variant=frdm_mcxn947_mcxn947_cpu0
frdm_mcxn947.build.mcu=cortex-m33
frdm_mcxn947.build.fpu=-mfpu=fpv5-sp-d16
frdm_mcxn947.build.architecture=cortex-m33
frdm_mcxn947.compiler.zephyr.arch.define=

frdm_mcxn947.build.board={build.variant}

frdm_mcxn947.build.float-abi=-mfloat-abi=hard
frdm_mcxn947.build.extra_flags=
frdm_mcxn947.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
frdm_mcxn947.build.board=frdm_mcxn947
frdm_mcxn947.compiler.zephyr.arch.define=
frdm_mcxn947.compiler.zephyr=
frdm_mcxn947.vid.0=0x1fc9
frdm_mcxn947.pid.0=0x0143
frdm_mcxn947.upload_port.0.vid=0x1fc9
frdm_mcxn947.upload_port.0.pid=0x0143
frdm_mcxn947.upload.address=0x100F0000
frdm_mcxn947.upload.target=mcxn947vdf

frdm_mcxn947.upload.tool=pyocd
frdm_mcxn947.upload.tool.default=pyocd
frdm_mcxn947.upload.protocol=
frdm_mcxn947.upload.transport=
frdm_mcxn947.upload.vid=0x1fc9
frdm_mcxn947.upload.pid=0x0143
frdm_mcxn947.upload.interface=0
frdm_mcxn947.upload.use_1200bps_touch=false
frdm_mcxn947.upload.wait_for_upload_port=false
frdm_mcxn947.upload.native_usb=true
frdm_mcxn947.upload.maximum_size=1966080
frdm_mcxn947.upload.maximum_data_size=523624

frdm_mcxn947.bootloader.tool=pyocd
frdm_mcxn947.bootloader.tool.default=pyocd
frdm_mcxn947.bootloader.file=zephyr-frdm_mcxn947_mcxn947_cpu0.elf
frdm_mcxn947.bootloader.target=mcxn947vdf


##########################################################################################

portentah7.name=Arduino Portenta H7
portentah7.build.core=arduino
portentah7.build.crossprefix=arm-zephyr-eabi-
portentah7.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

portentah7.menu.debug.false=Standard
portentah7.menu.debug.true=Debug

portentah7.menu.debug.false.postbuild_debug=
portentah7.menu.debug.true.postbuild_debug=-debug

portentah7.build.variant=arduino_portenta_h7
portentah7.build.mcu=cortex-m7
portentah7.build.fpu=-mfpu=fpv5-d16
portentah7.build.architecture=cortex-m7
portentah7.compiler.zephyr.arch.define=-DCORE_CM7

portentah7.build.board={build.variant}

portentah7.build.float-abi=-mfloat-abi=softfp
portentah7.build.extra_flags=
portentah7.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
portentah7.build.architecture=cortex-m7
portentah7.build.board=PORTENTA_H7
portentah7.compiler.zephyr=
portentah7.vid.0=0x2341
portentah7.pid.0=0x005b
portentah7.upload_port.0.vid=0x2341
portentah7.upload_port.0.pid=0x035b

portentah7.upload.tool=dfu-util
portentah7.upload.tool.default=dfu-util
portentah7.upload.protocol=
portentah7.upload.transport=
portentah7.upload.vid=0x2341
portentah7.upload.pid=0x035b
portentah7.upload.interface=0
portentah7.upload.use_1200bps_touch=true
portentah7.upload.wait_for_upload_port=true
portentah7.upload.native_usb=true
portentah7.upload.maximum_size=1966080
portentah7.upload.maximum_data_size=523624

portentah7.upload.address=0x080E0000

portentah7.upload.maximum_size=786432
portentah7.upload.maximum_data_size=523624

portentah7.bootloader.tool=dfu-util
portentah7.bootloader.tool.default=dfu-util
portentah7.bootloader.vid=0x2341
portentah7.bootloader.pid=0x035b
portentah7.bootloader.interface=0
portentah7.bootloader.file=zephyr-arduino_portenta_h7.bin
portentah7.bootloader.address=0x08040000

portentah7.debug.tool=gdb
portentah7.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
portentah7.debug.server.openocd.scripts.1={programmer.transport_script}
portentah7.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
portentah7.debug.cortex-debug.custom.request=attach
portentah7.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd

##############################################################################################################

frdm_rw612.name=RW612
frdm_rw612.build.core=arduino
frdm_rw612.build.crossprefix=arm-zephyr-eabi-
frdm_rw612.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

frdm_rw612.menu.debug.false=Standard
frdm_rw612.menu.debug.true=Debug

frdm_rw612.menu.debug.false.postbuild_debug=
frdm_rw612.menu.debug.true.postbuild_debug=-debug

frdm_rw612.build.variant=frdm_rw612
frdm_rw612.build.mcu=cortex-m33+nodsp
frdm_rw612.build.fpu=-mfpu=fpv5-sp-d16
frdm_rw612.build.architecture=cortex-m33+nodsp
frdm_rw612.compiler.zephyr.arch.define=

frdm_rw612.build.board={build.variant}

frdm_rw612.build.float-abi=-mfloat-abi=hard
frdm_rw612.build.extra_flags=
frdm_rw612.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
frdm_rw612.build.board=frdm_rw612
frdm_rw612.compiler.zephyr.arch.define=
frdm_rw612.compiler.zephyr=
frdm_rw612.vid.0=0x1fc9
frdm_rw612.pid.0=0x0143
frdm_rw612.upload_port.0.vid=0x1fc9
frdm_rw612.upload_port.0.pid=0x0143
frdm_rw612.upload.address=0x18323000
frdm_rw612.upload.target=rw612

frdm_rw612.upload.tool=pyocd
frdm_rw612.upload.tool.default=pyocd
frdm_rw612.upload.protocol=
frdm_rw612.upload.transport=
frdm_rw612.upload.vid=0x1fc9
frdm_rw612.upload.pid=0x0143
frdm_rw612.upload.interface=0
frdm_rw612.upload.use_1200bps_touch=false
frdm_rw612.upload.wait_for_upload_port=false
frdm_rw612.upload.native_usb=true
frdm_rw612.upload.maximum_size=1966080
frdm_rw612.upload.maximum_data_size=523624

frdm_rw612.bootloader.tool=pyocd
frdm_rw612.bootloader.tool.default=pyocd
frdm_rw612.bootloader.file=zephyr-frdm_rw612.elf
frdm_rw612.bootloader.target=rw612

##########################################################################################

niclasense.name=Arduino Nicla Sense ME
niclasense.build.core=arduino
niclasense.build.crossprefix=arm-zephyr-eabi-
niclasense.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

niclasense.menu.debug.false=Standard
niclasense.menu.debug.true=Debug

niclasense.menu.debug.false.postbuild_debug=
niclasense.menu.debug.true.postbuild_debug=-debug

niclasense.build.variant=arduino_nicla_sense_me
niclasense.build.mcu=cortex-m4
niclasense.build.fpu=-mfpu=fpv4-sp-d16
niclasense.build.architecture=cortex-m4
niclasense.compiler.zephyr.arch.define=

niclasense.build.board={build.variant}

niclasense.build.float-abi=-mfloat-abi=hard
niclasense.build.extra_flags=
niclasense.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
niclasense.build.architecture=cortex-m4
niclasense.build.board=ARDUINO_NICLA_SENSE_ME
niclasense.compiler.zephyr=
niclasense.vid.0=0x2341
niclasense.pid.0=0x0360
niclasense.upload_port.0.vid=0x2341
niclasense.upload_port.0.pid=0x0060

#niclasense.upload.tool=openocd
#niclasense.upload.tool.default=openocd
niclasense.upload.tool=pyocd
niclasense.upload.tool.default=pyocd
niclasense.upload.protocol=
niclasense.upload.transport=
niclasense.upload.vid=0x2341
niclasense.upload.pid=0x0060
niclasense.upload.interface=0
niclasense.upload.use_1200bps_touch=false
niclasense.upload.wait_for_upload_port=false
niclasense.upload.native_usb=false
niclasense.upload.maximum_size=1966080
niclasense.upload.maximum_data_size=523624
niclasense.upload.address=0x70000
niclasense.upload.target=nrf52

niclasense.upload.maximum_size=786432
niclasense.upload.maximum_data_size=523624

#niclasense.bootloader.tool=openocd
#niclasense.bootloader.tool.default=openocd
niclasense.bootloader.tool=pyocd
niclasense.bootloader.tool.default=pyocd
niclasense.bootloader.vid=0x2341
niclasense.bootloader.pid=0x0360
niclasense.bootloader.interface=0
niclasense.bootloader.file=zephyr-arduino_nicla_sense_me.hex
niclasense.bootloader.target=nrf52

niclasense.debug.tool=gdb
niclasense.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
niclasense.debug.server.openocd.scripts.1={programmer.transport_script}
niclasense.debug.server.openocd.scripts.2=target/nrf52.cfg
niclasense.debug.cortex-debug.custom.request=attach


##########################################################################################

portentac33.name=Portenta C33
portentac33.build.core=arduino
portentac33.build.crossprefix=arm-zephyr-eabi-
portentac33.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

portentac33.menu.debug.false=Standard
portentac33.menu.debug.true=Debug

portentac33.menu.debug.false.postbuild_debug=
portentac33.menu.debug.true.postbuild_debug=-debug

portentac33.menu.mode.llext=llext
portentac33.menu.mode.linked=linked

portentac33.menu.mode.linked.build.extra_ldflags=-lc -lm -lgcc -L{build.variant.path} -Wl,--wrap=random -Wl,--wrap=calloc -Wl,--wrap=free -Wl,--wrap=malloc -Wl,--wrap=realloc 
portentac33.menu.mode.linked.build.llext_link_flags=
portentac33.menu.mode.linked.build.suffix=_linked
portentac33.menu.mode.linked.build.ldscript={runtime.platform.path}/variants/linked/linker_script.ld
portentac33.menu.mode.linked.upload.extension=bin-zsk.bin
portentac33.menu.mode.linked.postbuild_mode=-linked

portentac33.build.variant=arduino_portenta_c33
portentac33.build.mcu=cortex-m33
portentac33.build.fpu=-mfpu=fpv5-sp-d16
portentac33.build.architecture=cortex-m33
portentac33.compiler.zephyr.arch.define=

portentac33.build.board={build.variant}

portentac33.build.float-abi=-mfloat-abi=hard
portentac33.build.extra_flags=
portentac33.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
portentac33.build.board=arduino_portenta_c33
portentac33.compiler.zephyr.arch.define=
portentac33.compiler.zephyr=
portentac33.vid.0=0x2341
portentac33.pid.0=0x0068
portentac33.upload_port.0.vid=0x2341
portentac33.upload_port.0.pid=0x0068
portentac33.upload.target=portentac33

portentac33.upload.tool=dfu-util
portentac33.upload.tool.default=dfu-util
portentac33.upload.protocol=
portentac33.upload.transport=
portentac33.upload.vid=0x2341
portentac33.upload.pid=0x0368
portentac33.upload.interface=1
portentac33.upload.use_1200bps_touch=true
portentac33.upload.wait_for_upload_port=false
portentac33.upload.native_usb=true
portentac33.upload.maximum_size=1966080
portentac33.upload.maximum_data_size=523624
portentac33.upload.address=0x100000
portentac33.upload.dfuse=-Q

portentac33.bootloader.tool=dfu-util
portentac33.bootloader.tool.default=dfu-util
portentac33.bootloader.file=zephyr-arduino_portenta_c33.bin
portentac33.bootloader.interface=0
portentac33.bootloader.address=0x10000
portentac33.bootloader.dfuse=-Q
